{
    "misconceptions": [
        {
            "text": "If an image shows a person, the text must be about that specific person.",
            "correction": "The text might be about a different person or a general statement about people.",
            "category": "person_identification"
        },
        {
            "text": "An image of a location automatically verifies any text about that location.",
            "correction": "The image must specifically show the events or conditions described in the text.",
            "category": "location_verification"
        },
        {
            "text": "If an image is real, any text associated with it must be true.",
            "correction": "Real images can be used with misleading or false text.",
            "category": "image_authenticity"
        },
        {
            "text": "The presence of certain objects in an image proves the text is true.",
            "correction": "Objects must be relevant to the specific claims in the text.",
            "category": "object_verification"
        },
        {
            "text": "If an image is recent, it must be related to current events mentioned in the text.",
            "correction": "Recent images can be used to illustrate unrelated or historical events.",
            "category": "temporal_verification"
        },
        {
            "text": "The emotional content of an image validates emotional claims in the text.",
            "correction": "Emotional content must be specifically related to the claims made.",
            "category": "emotional_verification"
        },
        {
            "text": "If an image shows a specific action, the text must be about that exact action.",
            "correction": "The action shown must be directly related to the claims in the text.",
            "category": "action_verification"
        },
        {
            "text": "The quality of an image indicates the truthfulness of the text.",
            "correction": "Image quality is independent of text accuracy.",
            "category": "quality_assessment"
        }
    ]
} 